# Pandas 功能
1. 允许为行和列设定标签；
2. 可以针对实际序列数据计算公洞统计学指标；
3. 轻松地处理 NaN 值；
4. 能够将不同格式的数据加载到 DataFrame 中；
5. 可以将不同的数据集合并到一起；
6. 与 NumPy 和 Matplotlib 集成；

In [1]:
import pandas as pd #导入Pandas

In [6]:
# 创建一个 Pandas Series
groceries = pd.Series(data = [30,6,'Yes','No'], index = ['eggs','apples','milk','bread'])
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [7]:
print('Groceries has shape:', groceries.shape)
print('Groceries has dimension:', groceries.ndim)
print('Groceries has a total of', groceries.size, 'elements')

Groceries has shape: (4,)
Groceries has dimension: 1
Groceries has a total of 4 elements

In [8]:
# 单独输出 Pandas Series 的索引标签和数据
print('The data in Groceries is:', groceries.values)
print('The index of Groceries is:', groceries.index)

The data in Groceries is: [30 6 'Yes' 'No']
The index of Groceries is: Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

### 如果你处理的是非常庞大的 Pandas Series，并且不清楚是否存在某个索引标签，可以使用 in 命令检查是否存在该标签：

In [9]:
# We check whether bananas is a food item (an index) in Groceries
x = 'bananas' in groceries
# We check whether bread is a food item (an index) in Groceries
y = 'bread' in groceries
# We print the results
print('Is bananas an index label in Groceries:', x)
print('Is bread an index label in Groceries:', y)

Is bananas an index label in Groceries: False
Is bread an index label in Groceries: True

### Pandas Series 提供了两个属性 .loc 和 .iloc，帮助我们清晰地表明指代哪种情况。属性 .loc 表示 位置，用于明确表明我们使用的是标签索引。同样，属性 .iloc 表示整型位置，用于明确表明我们使用的是数字索引

In [10]:
print('How many eggs and apples do we need to buy:\n',groceries.loc[['eggs','apples']])

How many eggs and apples do we need to buy:
 eggs      30
apples     6
dtype: object

In [11]:
# we use iloc to access multiple numerical indices
print('Do we need milk and bread:\n', groceries.iloc[[2,3]])

Do we need milk and bread:
 milk     Yes
bread     No
dtype: object

In [12]:
#更改Pandas Series中元素
groceries['eggs'] = 2  #直接修改了当前队列
groceries

eggs        2
apples      6
milk      Yes
bread      No
dtype: object

### 可以使用 .drop() 方法删除 Pandas Series 中的条目

In [13]:
#不会更改被修改的原始 Series
groceries.drop('apples')
groceries

eggs        2
apples      6
milk      Yes
bread      No
dtype: object

In [14]:
#添加inplace参数，设置为True，那么久从原始 Series 删除元素
groceries.drop('apples',inplace=True)
groceries

eggs       2
milk     Yes
bread     No
dtype: object

### Pandas算数运算

In [15]:
fruits = pd.Series(data = [10,6,3], index = ['apples','oranges','bananas'])
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [16]:
print('fruits + 2:\n', fruits + 2) # We add 2 to each item in fruits

fruits + 2:
 apples     12
oranges     8
bananas     5
dtype: int64

In [17]:
print('fruits * 2:\n', fruits * 2) # We multiply each item in fruits by 2

fruits * 2:
 apples     20
oranges    12
bananas     6
dtype: int64

In [18]:
import numpy as np
# print('EXP(X) = \n', np.exp(fruits))
# print() 
# print('SQRT(X) =\n', np.sqrt(fruits))
# print()
# print('POW(X,2) =\n',np.power(fruits,2)) # We raise all elements of fruits to the power of 2

In [19]:
# We add 2 only to the bananas 操作指定元素
print('Amount of bananas + 2 = ', fruits['bananas'] + 2)

Amount of bananas + 2 =  5

In [20]:
print('Amount of apples - 2 = ', fruits.iloc[0] - 2)

Amount of apples - 2 =  8

In [21]:
print('We double the amount of apples and oranges:\n', fruits[['apples', 'oranges']] * 2)

We double the amount of apples and oranges:
 apples     20
oranges    12
dtype: int64

In [22]:
print('We half the amount of apples and oranges:\n', fruits.loc[['apples', 'oranges']] / 2)

We half the amount of apples and oranges:
 apples     5.0
oranges    3.0
dtype: float64

### Pandas DataFrames: 具有带标签的行和列的二维数据结构，可以存储很多类型的数据

In [23]:
# We create a dictionary of Pandas Series 
items = {'Bob':pd.Series(data=[245,25,55],index=['bike','pants','watch']),
        'Alice':pd.Series(data=[10,110,500,45],index=['book','glasses','bike','pants'])}
print(type(items))

<class 'dict'>

In [24]:
shopping_carts = pd.DataFrame(items)
shopping_carts

         Alice    Bob
bike     500.0  245.0
book      10.0    NaN
glasses  110.0    NaN
pants     45.0   25.0
watch      NaN   55.0

### DataFrame 的行标签根据构建字典所用的两个 Pandas Series 的key创建而成；DataFrame 的列标签来自字典的键;列按照字母顺序排序，而不是字典中的顺序;

In [25]:
print('The data in shopping_carts is:\n', shopping_carts.values)
print()

The data in shopping_carts is:
 [[500. 245.]
 [ 10.  nan]
 [110.  nan]
 [ 45.  25.]
 [ nan  55.]]

In [26]:
print('The row index in shopping_carts is:', shopping_carts.index)
print()
print('The column index in shopping_carts is:', shopping_carts.columns)

The row index in shopping_carts is: Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

The column index in shopping_carts is: Index(['Alice', 'Bob'], dtype='object')

### 通过关键字 columns 和 index 选择要将哪些数据放入 DataFrame 中

In [27]:
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])

bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [28]:
#We Create a DataFrame that only has selected items for both Alice and Bob
sel_shopping_cart = pd.DataFrame(items, index = ['pants', 'book'])

# We display sel_shopping_cart
sel_shopping_cart

       Alice   Bob
pants     45  25.0
book      10   NaN

In [29]:
# We Create a DataFrame that only has selected items for Alice
alice_sel_shopping_cart = pd.DataFrame(items, index = ['glasses', 'bike'], columns = ['Alice'])
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

### 使用列表（数组）字典手动地创建 DataFrame:
1. 创建一个字典；
2. 将改字典传递给pd.DataFrame()函数

In [30]:
data = {'Integers':[1,2,3],'Floats':[1.2,2.3,3.4]}
df = pd.DataFrame(data)
df

   Floats  Integers
0     1.2         1
1     2.3         2
2     3.4         3

In [31]:
#添加标签索引
df = pd.DataFrame(data,index = ['label1','label2','label3'])
df

        Floats  Integers
label1     1.2         1
label2     2.3         2
label3     3.4         3

In [32]:
item2 = [{'bikes':20,'pants':30,'watches':35},
        {'watches':10,'galsses':50,'bikes':15,'pants':5}]
# store_item2 = pd.DataFrame(item2)

store_item2 = pd.DataFrame(item2,index=['store1','store2'])
store_item2

        bikes  galsses  pants  watches
store1     20      NaN     30       35
store2     15     50.0      5       10

In [33]:
print(type(store_item2))

<class 'pandas.core.frame.DataFrame'>

In [34]:
print(store_item2[['bikes']])

        bikes
store1     20
store2     15

In [35]:
print(store_item2[['bikes','pants']])

        bikes  pants
store1     20     30
store2     15      5

In [36]:
print(store_item2.loc[['store1']])

        bikes  galsses  pants  watches
store1     20      NaN     30       35

In [37]:
print(store_item2.iloc[[0]])

        bikes  galsses  pants  watches
store1     20      NaN     30       35

### 在访问 DataFrame 中的单个元素时,必须始终提供标签，并且列标签在前，格式为 dataframe[column][row]

In [38]:
print(store_item2['bikes']['store2'])

15

### 要向 DataFrame 中添加行，我们首先需要创建新的 Dataframe，然后将其附加到原始 DataFrame 上

In [39]:
new_items = [{'bikes':20,'pants':30,'watches':35,'glasses':4}]
new_store = pd.DataFrame(new_items,index = ['store 3'])
new_store

         bikes  glasses  pants  watches
store 3     20        4     30       35

### 使用 .append() 方法将此行添加到 store_items DataFrame 中

In [40]:
store_item2 = store_item2.append(new_store)
store_item2

         bikes  galsses  glasses  pants  watches
store1      20      NaN      NaN     30       35
store2      15     50.0      NaN      5       10
store 3     20      NaN      4.0     30       35

### dataframe.insert(loc,label,data) 方法使我们能够将新列（具有给定列标签和给定数据）插入 dataframe 的 loc 位置。

In [47]:
# We insert a new column with label shoes right before the column with numerical index 4
store_item2.insert(4, 'hats', [18,25,2,])
store_item2

         bikes  galsses  glasses  pants  hats  shoes  watches
store1      20      NaN      NaN     30    18      8       35
store2      15     50.0      NaN      5    25      5       10
store 3     20      NaN      4.0     30     2      0       35

### 要删除 DataFrame 中的行和列，我们将使用 .pop() 和 .drop() 方法。.pop() 方法仅允许我们删除列，而 .drop() 方法可以同时用于删除行和列，只需使用关键字 axis 即可

In [48]:
store_item2 = store_item2.drop(['store 3','0'],axis = 0)
store_item2

ValueError: labels ['0'] not contained in axis

### 更改行和列标签。我们使用 .rename() 方法将 bikes 列标签改为 hats

In [49]:
store_item2 = store_item2.rename(columns={'bikes': 'hats'})
store_item2

         hats  galsses  glasses  pants  hats  shoes  watches
store1     20      NaN      NaN     30    18      8       35
store2     15     50.0      NaN      5    25      5       10
store 3    20      NaN      4.0     30     2      0       35

In [69]:
# We change the row label from store 3 to last store
store_item2 = store_item2.rename(index={'store1':'store3'})
store_item2

        hats  galsses  glasses  pants  shoes  watches
store3    20      NaN      NaN     30      8       35
store2    15     50.0      NaN      5      5       10
0         20      NaN      4.0     30      0       35
0         20      NaN      4.0     30      8       35

### 可以将索引改为 DataFrame 中的某个列。

In [50]:
store_item2 = store_item2.set_index('pants')
store_item2

       hats  galsses  glasses  hats  shoes  watches
pants
30       20      NaN      NaN    18      8       35
5        15     50.0      NaN    25      5       10
30       20      NaN      4.0     2      0       35

### 处理NaN

In [52]:
item2 = [{'bikes':20,'pants':30,'watches':35,'shirts':15,'shoes':8,'suits':45},{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}
]
store_items = pd.DataFrame(item2,index=['store1','store2','store3'])
store_items

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      NaN     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     NaN     10    NaN       35

### 同时使用了 .isnull() 和 sum() 方法来计算我们的 DataFrame 中的 NaN 值的数量;.isnull() 方法返回一个大小和 store_items 一样的布尔型 DataFrame,并用 True 表示具有 NaN 值的元素，用 False 表示非 NaN 值的元素;使用 .sum() 方法两次，是因为第一个 sum() 返回一个 Pandas Series，其中存储了列上的逻辑值 True 的总数,第二个 sum() 将上述 Pandas Series 中的 1 相加。

In [53]:
x = store_items.isnull().sum().sum()
# We print x
print('Number of NaN values in our DataFrame:', x)

Number of NaN values in our DataFrame: 3

In [54]:
store_items.isnull()

        bikes  glasses  pants  shirts  shoes  suits  watches
store1  False     True  False   False  False  False    False
store2  False    False  False   False  False  False    False
store3  False    False  False    True  False   True    False

In [55]:
store_items.isnull().sum()

bikes      0
glasses    1
pants      0
shirts     1
shoes      0
suits      1
watches    0
dtype: int64

### 除了数 NaN 值的数量之外，我们还可以采用相反的方式，我们可以数非 NaN 值的数量。为此，我们可以使用 .count() 方法

In [56]:
print('Number of non-NaN values in the columns of our DataFrame:\n', store_items.count())

Number of non-NaN values in the columns of our DataFrame:
 bikes      3
glasses    2
pants      3
shirts     2
shoes      3
suits      2
watches    3
dtype: int64

### 通常，我们有两种选择，可以删除或替换 NaN 值。如果 axis = 0，.dropna(axis) 方法将删除包含 NaN 值的任何行，如果 axis = 1，.dropna(axis) 方法将删除包含 NaN 值的任何列。.dropna() 方法不在原地地删除具有 NaN 值的行或列。也就是说，原始 DataFrame 不会改变。你始终可以在 dropna() 方法中将关键字 inplace 设为 True，在原地删除目标行或列。

In [57]:
# We drop any rows with NaN values
store_items.dropna(axis = 0)

        bikes  glasses  pants  shirts  shoes  suits  watches
store2     15     50.0      5     2.0      5    7.0       10

In [58]:
# We drop any columns with NaN values
store_items.dropna(axis = 1)

        bikes  pants  shoes  watches
store1     20     30      8       35
store2     15      5      5       10
store3     20     30     10       35

### 可以选择将所有 NaN 值替换为 0。为此，我们可以使用 .fillna() 方法

In [59]:
store_items.fillna(0)

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      0.0     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     0.0     10    0.0       35

### 还可以使用 .fillna() 方法将 NaN 值替换为 DataFrame 中的上个值，称之为前向填充。在通过前向填充替换 NaN 值时，我们可以使用列或行中的上个值。.fillna(method = 'ffill', axis) 将通过前向填充 (ffill) 方法沿着给定 axis 使用上个已知值替换 NaN 值。

In [60]:
# We replace NaN values with the previous value in the column
store_items.fillna(method = 'ffill', axis = 0)

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      NaN     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     2.0     10    7.0       35

### 可以选择用 DataFrame 中之后的值替换 NaN 值，称之为后向填充。.fillna(method = 'backfill', axis) 将通过后向填充 (backfill) 方法沿着给定 axis 使用下个已知值替换 NaN 值

In [61]:
store_items.fillna(method='backfill',axis=0)

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20     50.0     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     NaN     10    NaN       35

In [62]:
#store3 中有NaN值，可以使用下个列值向后填充
store_items.fillna(method='backfill',axis=1)

        bikes  glasses  pants  shirts  shoes  suits  watches
store1   20.0     30.0   30.0    15.0    8.0   45.0     35.0
store2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store3   20.0      4.0   30.0    10.0   10.0   35.0     35.0

### .fillna() 方法不在原地地替换（填充）NaN 值。也就是说，原始 DataFrame 不会改变。你始终可以在 fillna() 函数中将关键字 inplace 设为 True，在原地替换 NaN 值。

### .interpolate(method = 'linear', axis) 方法将通过 linear 插值使用沿着给定 axis 的值替换 NaN 值

In [63]:
store_items.interpolate(method='linear',axis=0)

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      NaN     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     2.0     10    7.0       35

### 将数据加载到 Pandas DataFrame 中

In [68]:
# 我们将 Google 股票数据加载到 DataFrame 中
titanic_data = pd.read_csv('./titanic-data.csv')

# 我们输出关于 Google_stock 的一些信息
print('Google_stock is of type:', type(titanic_data))
print('Google_stock has shape:', titanic_data.shape)

Google_stock is of type: <class 'pandas.core.frame.DataFrame'>
Google_stock has shape: (891, 12)

### 在处理这样的大型数据集时，通常有必要直接查看前几行数据，而不是整个数据集。我们可以使用 .head() 方法查看前 5 行数据

In [69]:
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 可以使用 .tail() 方法查看最后 5 行数据：

In [70]:
titanic_data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

### 还可以选择使用 .head(N) 或 .tail(N) 分别显示前 N 行和后 N 行数据。

### 快速检查下数据集中是否有任何 NaN 值。为此，我们将使用 .isnull() 方法，然后是 .any() 方法，检查是否有任何列包含 NaN 值。

In [71]:
titanic_data.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

### 在处理大型数据集时，通常有必要获取关于数据集的统计信息。通过使用 Pandas 的 .describe() 方法，可以获取关于 DataFrame 每列的描述性统计信息。

In [72]:
titanic_data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### 可以对单列应用 .describe() 方法

In [74]:
titanic_data['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [76]:
# We print information about our DataFrame  
print()
print('每一列最大值:\n', titanic_data.max())
print()
print('Age列最小值:', titanic_data['Age'].min())
print()
print('每一列平均值:\n', titanic_data.mean())

每一列最大值:
 PassengerId                            891
Survived                                 1
Pclass                                   3
Name           van Melkebeke, Mr. Philemon
Sex                                   male
Age                                     80
SibSp                                    8
Parch                                    6
Ticket                           WE/P 5735
Fare                               512.329
dtype: object

Age列最小值: 0.42

每一列平均值:
 PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

### 另一个重要统计学衡量指标是数据相关性。数据相关性可以告诉我们不同列的数据是否有关联。我们可以使用 .corr() 方法获取不同列之间的关联性，

In [77]:
# We display the correlation between columns
titanic_data.corr()#关联性值为 1 表明关联性很高，关联性值为 0 告诉我们数据根本不相关。

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

### 使用 .groupby() 方法按年份对数据分组，然后使用 .sum() 方法将所有员工的薪资相加。

In [ ]:
# We display the total amount of money spent in salaries each year
# data.groupby(['Year'])['Salary'].sum()
# We display the average salary per year
# data.groupby(['Year'])['Salary'].mean()
# We display the salary distribution per department per year.
# data.groupby(['Year', 'Department'])['Salary'].sum()